/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/

/**============================================================================
* @FileName    : main.c
* @Description : None
* @Date        : 2016/2/25
* @By          : WindRises（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5(TM4C123GH6PZ)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/ 
#include "My_Labrary.h"
#include "My_GPIO.h"   
#include "My_System.h"
#include "My_Timer.h"
#include "My_Delay.h" 
#include "My_LCD12864.h"
#include "My_LCD.h"
#include "My_Key.h" 

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数编写 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @FunctionName  : main()     
* @Description   : 主函数              
* @Data          : 2016/2/25  
* @Explain       : 很多文件名我都加上了 "My_" ，不加可能会与系统文件冲突
------------------------------------------------------------------------------*/
extern u8 _temp[6];
int main(void)
{
	u32 i = 0; 
	u8 _ch[20] = {0},_x = 0;
    System_Init(); //系统初始化         
	GPIO_Init();   //普通GPIO口初始化                
	Timer0A_Init();  //定时器初始化                   
	LCD12864_Init();	//LCD12864初始化        
	Key_Init(); 
 
	while (1) 
	{ 
		 
		
		LCD_Num(0,0,i++,10);  
		
//		if(_ch[_x-1] == 'B')
//		{
//			LCD_Clear();
//			while(_x--) _ch[_x] = 0;
//			
//		}
//		
//		_ch[_x] = Key_Read();	
//		if(_ch[_x] != 0) _x++;	
		  
		LCD_Num(0,2,_temp[0],3);
		LCD_Num(2,2,_temp[1],3);
		LCD_Num(4,2,_temp[2],3);
		
		LCD_Num(0,3,_temp[3],3);
		LCD_Num(2,3,_temp[4],3);
		LCD_Num(4,3,_temp[5],3);
		 
	}
	 
}






/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/















