/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/

/**============================================================================
* @FileName    : My_Key.c
* @Description : LCD12864自用显示程序
* @Date        : 2016/2/28
* @By          : WindRises（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5(TM4C123GH6PZ)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/ 
#include "My_Key.h"  

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/

/* 全局结构体定义 -------------------------------------------------------------*/
Key_TypeDef g_keyboard = {0};  //g_ 代表全局变量
																	
/* 私有（静态）函数编写 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @FunctionName  : My_KeyInit()     
* @Description   : 串口键盘初始化函数    
* @Programer     : WindRises（谢玉伸）   
* @Data          : 2016/2/28     
* @Explain       : None   
------------------------------------------------------------------------------*/
void My_KeyInit(void)
{
	
	/* Step 1 使能 ------------------------------*/       
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);  //使能IO口     
	
	/* Step 2 配置成输入 ------------------------*/ 
  	GPIOPinTypeGPIOInput(GPIO_PORTB_BASE,GPIO_PIN_0|GPIO_PIN_1);   //配置成输入
	GPIODirModeSet(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1, GPIO_DIR_MODE_IN);
	
	/* Step 3 配置中断方式 ----------------------*/ 
    GPIOIntTypeSet(GPIO_PORTB_BASE,GPIO_PIN_1,GPIO_FALLING_EDGE);  //配置成下降沿 
	
	/* Step 4 配置中断IO口 ----------------------*/ 
    GPIOIntEnable(GPIO_PORTB_BASE,GPIO_PIN_1);   //配置中断的IO口  
	
	/* Step 5 使能中断 --------------------------*/ 
	IntEnable(INT_GPIOB);   //使能IO口
	IntMasterEnable();             
	
}




/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/





