/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/

/**============================================================================
* @FileName    : main.c
* @Description : None
* @Date        : 2016/2/25
* @By          : WindRises（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5(TM4C123GH6PZ)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/ 
#include "My_Labrary.h"
#include "My_GPIO.h"   
#include "My_System.h"
#include "My_Timer.h"
#include "My_Delay.h" 
#include "My_LCD12864.h"
#include "My_LCD.h"
#include "My_Key.h" 
#include "My_TFT.h"	

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数编写 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @FunctionName  : main()     
* @Description   : 主函数              
* @Data          : 2016/2/25  
* @Explain       : 很多文件名我都加上了 "My_" ，不加可能会与系统文件冲突
------------------------------------------------------------------------------*/

int main(void)
{ 
    System_Init(); //系统初始化         
	GPIO_Init();   //普通GPIO口初始化                
	Timer0A_Init();  //定时器初始化                   
//	LCD12864_Init();	//LCD12864初始化   
	TFT_Init();	
//	Key_Init();   
	TFT_Clear(BLACK);
	TextColor = WHITE; 
	
	while (1) 
	{ 
		
		LCD_String_Show(FONT_1,FONT_1,(u8*)"Hello",FONT_1);
		LCD_String_Show(FONT_2,50,(u8*)"TFT ILI9341",FONT_2); 
		LCD_String_Show(20,100,(u8*)"0123456789",FONT_3);
		
		LCD_String_Show(100,150,(u8*)"XieYushen",FONT_3);
		LCD_String_Show(40,200,(u8*)"(C) COPYRIGHT 2016 WindRises",FONT_2); 
//		KeyBorad_Show(); 
	}
	 
}






/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/















