/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/
/**============================================================================
* @FileName    : My_Delay.c
* @Description : None
* @Date        : 2016/2/25
* @By          : WindRises（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5(TM4C123GH6PZ)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Delay.h" 

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/

/* 全局变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数编写 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @FunctionName  : delay_ms()     
* @Description   : ms延时函数
* @Parameter     : _ms :延时ms
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2016/2/25
* @Explain       : None
------------------------------------------------------------------------------*/
void delay_ms(u32 _ms)
{
	u32 _delay_ms;
	_delay_ms = SysCtlClockGet()*_ms/3;  //官方：The loop takes 3 cycles/loop.
	_delay_ms /= 2;					   //系统自带2分频	
	_delay_ms /= 1000; 		    	   //从s转化成ms
	SysCtlDelay( _delay_ms );	
}

/**----------------------------------------------------------------------------
* @FunctionName  : delay_us()     
* @Description   : us延时函数
* @Parameter     : _us :延时us
* @Return        : void
* @Programer     : WindRises（谢玉伸）
* @Data          : 2016/2/25
* @Explain       : None
------------------------------------------------------------------------------*/
void delay_us(u32 _us)
{
	u32 _delay_us;
	/* 以下是计算出来的延时相当精确 -------------------*/
	if(_us > 4)
	{
		_us -= 4; 
		_delay_us = (SysCtlClockGet()/1000)*_us/3;  //官方：The loop takes 3 cycles/loop.
		_delay_us /= 2;						  	 	//系统自带2分频	
		_delay_us /= 1000; 		    			    //从s转化成ms
		SysCtlDelay( _delay_us );
	}
	
	/* 以下都是调试出来的延时，还算是比较精确 ---------*/
	else if(_us == 1)
	{
		_us = 0; 
		while(_us--);	
	}
	else if(_us == 2)
	{
		_us = 7; 
		while(_us--);	
	}
	else if(_us == 3)
	{
		_us = 15; 
		while(_us--);	
	}
	else if(_us == 4)
	{
		_us = 23; 
		while(_us--);	
	}		
		
}



/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/

