/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/
/**============================================================================
* @FileName    : My_Interrupt.c
* @Description : 中断驱动
* @Date        : 2016/2/25
* @By          : WindRises（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5(TM4C123GH6PZ)
* @Explain     : None
*=============================================================================*/
/* 头文件包含 -----------------------------------------------------------------*/
#include "My_Interrupt.h"
#include "My_GPIO.h"   
#include "My_PS2Key.h"  
#include "My_LCD.h"
#include "My_Delay.h" 

/* 私有宏定义 -----------------------------------------------------------------*/

/* 私有变量定义 ---------------------------------------------------------------*/

/* 私有（静态）函数声明 --------------------------------------------------------*/
 
/* 全局变量定义 ---------------------------------------------------------------*/
extern u16 global;  

/* 私有（静态）函数编写 --------------------------------------------------------*/

/* 全局函数编写 ---------------------------------------------------------------*/

/**----------------------------------------------------------------------------
* @FunctionName  : Timer0A_IntHandler()     
* @Description   : 定时器服务函数 		
* @Programer     : WindRises（谢玉伸）				
* @Data          : 2016/2/27						
* @Explain       : None					
------------------------------------------------------------------------------*/
void Timer0A_IntHandler(void) 
{
	static u8 LED_SW = 0;         
	TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT); //(放前,定时较准)  
	
	LED_SW = ~LED_SW;    
	
	if(LED_SW) LED4_ON();                           
	else LED4_OFF();               
	  
}

/**----------------------------------------------------------------------------
* @FunctionName  : GPIOJ_IntHandler()     
* @Description   : GPIOJ外部中断服务函数 		
* @Programer     : WindRises（谢玉伸）				
* @Data          : 2016/2/27						
* @Explain       : None					
------------------------------------------------------------------------------*/ 
void GPIOJ_IntHandler(void)  
{           
	 
	global ++; 
	GPIOIntClear(GPIO_PORTJ_BASE,GPIO_PIN_1);  //清除中断标志，一定要放后面(放前面容易死机)       
	
}








/*******************************(C) COPYRIGHT 2016 WindRises（谢玉伸）*********************************/
